---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameValue
source: html/6f00db66-6f97-262a-ceba-927cc91d8c72.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameValue Property

"Single day frame"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySingledayFrameValue { get; }
```